WS-I/BP1.2/Messages/ComplexDataTypes/XmlFormatter/DocLitW/SoapWsdl.ComplexDataTypes.XmlFormatter.DocLitWrapped_RetArrayInt1D_Client_Request-1.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IComplexDataTypesDocLitW/RetArrayInt1D</a:Action>
    <a:MessageID>urn:uuid:1e9d7dbf-02d1-4ff8-9b30-5707787ce197</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body>
    <RetArrayInt1D xmlns="http://tempuri.org/">
      <inArrayInt1D />
    </RetArrayInt1D>
  </s:Body>
</s:Envelope>